Файлы_конфигурации/DataProcessors/ЗаказыИПоступления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗаказыИПоступления</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументЗаказа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поступления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Файлы_конфигурации/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЕдиницыИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Файлы_конфигурации/DataProcessors/ЗаказыИПоступления/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода  = КонецДня(ТекущаяДата());
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ВыбЗаказы = Документы.ЗаказПоставщику.Выбрать(НачалоПериода,КонецПериода);
	
	Пока ВыбЗаказы.Следующий() Цикл
		СтрокаЗаказы                = Объект.Заказы.Добавить();
		СтрокаЗаказы.ДокументЗаказа = ВыбЗаказы.Ссылка;
		СтрокаЗаказы.СуммаДокумента = ВыбЗаказы.СуммаДокумента;
	КонецЦикла;

	ВыбПоступления = Документы.ПриходнаяНакладная.Выбрать(НачалоПериода,КонецПериода);
	
	Пока ВыбПоступления.Следующий() Цикл
		СтрокаПоступления                     = Объект.Поступления.Добавить();
		СтрокаПоступления.ДокументПоступления = ВыбПоступления.Ссылка;
		СтрокаПоступления.СуммаДокумента      = ВыбПоступления.СуммаДокумента;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()

	ВыбЗаказы = Документы.ЗаказПоставщику.Выбрать(НачалоПериода,КонецПериода);
	
	Объект.Заказы.Очистить();
	
	Пока ВыбЗаказы.Следующий() Цикл
		СтрокаЗаказы                = Объект.Заказы.Добавить();
		СтрокаЗаказы.ДокументЗаказа = ВыбЗаказы.Ссылка;
		СтрокаЗаказы.СуммаДокумента = ВыбЗаказы.СуммаДокумента;
	КонецЦикла;

	ВыбПоступления = Документы.ПриходнаяНакладная.Выбрать(НачалоПериода,КонецПериода);
	
	Объект.Поступления.Очистить();
	
	Пока ВыбПоступления.Следующий() Цикл
		СтрокаПоступления                     = Объект.Поступления.Добавить();
		СтрокаПоступления.ДокументПоступления = ВыбПоступления.Ссылка;
		СтрокаПоступления.СуммаДокумента      = ВыбПоступления.СуммаДокумента;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//НачалоПериода = Дата("20220101");
	//КонецПериода  = КонецДня(ТекущаяДата()); 
	
	//ВыбЗаказы      = Документы.ЗаказПоставщику.Выбрать(Дата("20220101"),КонецДня(ТекущаяДата()));
	//
	//Пока ВыбЗаказы.Следующий() Цикл
	//	СтрокаЗаказы                = Объект.Заказы.Добавить();
	//	СтрокаЗаказы.ДокументЗаказа = ВыбЗаказы.Ссылка;
	//	СтрокаЗаказы.СуммаДокумента = ВыбЗаказы.СуммаДокумента;
	//КонецЦикла;

	//ВыбПоступления = Документы.ПриходнаяНакладная.Выбрать(Дата("20220101"),КонецДня(ТекущаяДата()));
	//
	//Пока ВыбПоступления.Следующий() Цикл
	//	СтрокаПоступления                     = Объект.Поступления.Добавить();
	//	СтрокаПоступления.ДокументПоступления = ВыбПоступления.Ссылка;
	//	СтрокаПоступления.СуммаДокумента      = ВыбПоступления.СуммаДокумента;
	//КонецЦикла;
	
КонецПроцедуры
